25.w20d2-tweet_R/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        render json: { status: "200", tweet: Tweet.all}
---
SELECT "tweets".* FROM "tweets"

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "ramdom title"], ["content", "random content"], ["author", "Andrei H."]]